Revit 2024 API
ViewDisplayEdges Enumeration
 A collection of settings defining how visible edges are displayed
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum ViewDisplayEdges
Visual Basic
Public Enumeration ViewDisplayEdges
Visual C++
public enum class ViewDisplayEdges
Members
Member name | Description
None |  The edges are invisible
Simple |  The edges are visible and drawn according to style
See Also
Autodesk.Revit.DB Namespace